{
    "widget": {
        "name": "Callpicker VOIP",
        "description": "Widget para integración métodos VoIP para manejo de llamadas (Click-to-Call) con Callpicker desde Kommo",
        "short_description": "Integración Click-to-Call",
        "call_action": "Llamada Callpicker"
    },
    "settings": {
        "cp_client_id": "Callpicker ID",
        "cp_client_secret": "Callpicker Secret",
        "cp_kommousers_extensions": "Extensiones Callpicker:Estos son los usuarios Kommo asociados con esta cuenta, agrega los Extension Id de Callpicker Admin en el campo en blanco.",
        "preferred_trunk": "Configuración de Troncal Preferida",
        "cp_widget_settings": "Configuraciones para funcionalidad Click to Call"
    },
    "callpickerCodes": {
        "kommo_auth_success": " ✅ Integración Callpicker instalada correctamente",
        "unauthorized_client": "⚠️ El acceso a la API de Callpicker está limitado. Contacte a soporte Callpicker para solicitar que se active el acceso a la API de marcación de Callpicker (Dial API)",
        "ctc_bad_conflict": "⚠️ El acceso a la API de Callpicker está limitado. Contacte a soporte Callpicker para solicitar que se active el acceso a la API de marcación de Callpicker (Dial API)",
        "cp_unexpected_error": "❌ Intenta de nuevo o consulte a soporte Callpicker",
        "invalid_client": "❌ Credenciales Callpicker Inválidas",
        "unexpected_amo_api_error": "❌ Ocurrió un error inesperado al instalar la integración de Kommo, es necesario borrar esta integración y comenzar de nuevo. Consulte la documentación de Callpicker para más detalles.",
        "amo_api_error": "❌ Ocurrió un error inesperado al instalar la integración de Kommo, es necesario borrar esta integración y comenzar de nuevo. Consulte la documentación de Callpicker para más detalles."
    },
    "callpickerMessages": {
        "extensions_instructions": "En la siguiente sección se muestran configuraciones adicionales de la integración click-to-call",
        "extensions_id_not_match": "Revisa que el ID de extensión Callpicker ingresado sea uno válido de tu cuenta",
        "extensions_ids_recommendation": "Te recomendamos configurar el ID de extensión a todos tus usuarios de Kommo para garantizar el funcionamiento de la integración.",
        "configurations_error": "Error al consultar las extensiones de tu cuenta Callpicker. Consulte la documentación de Callpicker para más detalles.",
        "ctc_empty_extension": "No se ha configurado un ID de extensión Callpicker para el usuario en sesión. Actualice la configuración de la integración e intente de nuevo.",
        "ctc_unexpected_error": "Ha ocurrido un error inesperado al enlazar la llamada, intente de nuevo. Si el problema persiste, contacte a soporte Callpicker",
        "ctc_invalid_phone_destination": "Asegúrese que el número de teléfono _ destino tenga un formato de teléfono válido. El teléfono no debe contener caracteres alfabéticos ni caracteres especiales.",
        "ctc_invalid_origin_extension": "Asegúrese que el ID de extensión _ asociado al usuario en sesión sea correcto. Si el problema persiste, contacte a soporte Callpicker.",
        "ctc_notification_header": "Llamada Saliente Callpicker",
        "ctc_notification_body": "Marcando número",
        "ctc_empty_sip_credentials": "Ha ocurrido un error al autenticar la extensión para recepción de llamadas, por favor recargue la página. Si el problema persiste comuníquese con soporte de Callpicker",
        "ctc_unespected_api_error": "Ha ocurrido un error inesperado al obtener las credenciales de la extensión" 
    }
}